var fantasy = {
    players: [
        {
            name: 'Шут',
            team: [
                'Артик',
                'DOCtoR',
                'Интерактив',
                'Нефелим',
            ],
        },
        {
            name: 'Волна',
            team: [
                'NLIP',
                'Маг',
                'Sky',
                'Лекса',
            ],
        },
        {
            name: 'Крис',
            team: [
                'Крис',
                'Фифа',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'Архи',
            team: [
                'Наполеон',
                'Sky',
                'Самаритянка',
                'Интерактив',
            ],
        },
        {
            name: 'Никки',
            team: [
                'NLIP',
                'Мориарти',
                'DOCtoR',
                'Лекса',
            ],
        },
        {
            name: 'awd2',
            team: [
                'Флэш',
                'Remedy',
                'Весна',
                'Нефелим',
            ],
        },
        {
            name: 'Крис',
            team: [
                'Крис',
                'Фифа',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'Natsy',
            team: [
                'Артик',
                'Жнец',
                'Нефелим',
                'Natsy',
            ],
        },
        {
            name: 'NLIP',
            team: [
                'NLIP',
                'Ylitko',
                'DOCtoR',
                'Весна',
            ],
        },
        {
            name: 'Нефелим',
            team: [
                'Артик',
                'Андерсен',
                'Интерактив',
                'Нефелим',
            ],
        },
        {
            name: 'Ylitko',
            team: [
                'Артик',
                'Ylitko',
                'Криста',
                'Юрия',
            ],
        },
        {
            name: 'Гермес',
            team: [
                'Sky',
                'Самаритянка',
                'Мишок',
                'Таварес',
            ],
        },
        {
            name: 'Картман',
            team: [
                'Артик',
                'Бон',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'ВБ',
            team: [
                'Наполеон',
                'Жнец',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'Самаритянка',
            team: [
                'Артик',
                'DOCtoR',
                'Самаритянка',
                'Юрия',
            ],
        },
        {
            name: 'Light',
            team: [
                'Ylitko',
                'Мориарти',
                'Sky',
                'Самаритянка',
            ],
        },
        {
            name: 'Юрия',
            team: [
                'Артик',
                'Жнец',
                'Лекса',
                'Нефелим',
            ],
        },
        {
            name: 'Мишок',
            team: [
                'Наполеон',
                'Андерсен',
                'Мишок',
                'Юрия',
            ],
        },
        {
            name: 'Фифа',
            team: [
                'Артик',
                'Фифа',
                'Сергеевна',
                'Нефелим',
            ],
        },
        {
            name: 'Светлячок',
            team: [
                'Наполеон',
                'Маг',
                'DOCtoR',
                'Natsy',
            ],
        },
    ],
};