var fantasy = {
    players: [
        {
            name: 'Шут',
            team: [
                'Артик',
                'DOCtoR',
                'Интерактив',
                'Нефелим',
            ],
        },
        {
            name: 'Волна',
            team: [
                'NLIP',
                'Маг',
                'Sky',
                'Лекса',
            ],
        },
        {
            name: 'Крис',
            team: [
                'Крис',
                'Фифа',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'Архи',
            team: [
                'Наполеон',
                'Sky',
                'Самаритянка',
                'Интерактив',
            ],
        },
        {
            name: 'Никки',
            team: [
                'NLIP',
                'Мориарти',
                'DOCtoR',
                'Лекса',
            ],
        },
        {
            name: 'awd2',
            team: [
                'Флэш',
                'Remedy',
                'Весна',
                'Нефелим',
            ],
        },
        {
            name: 'Natsy',
            team: [
                'Артик',
                'Жнец',
                'Нефелим',
                'Natsy',
            ],
        },
        {
            name: 'NLIP',
            team: [
                'NLIP',
                'Ylitko',
                'DOCtoR',
                'Весна',
            ],
        },
        {
            name: 'Нефелим',
            team: [
                'Артик',
                'Андерсен',
                'Интерактив',
                'Нефелим',
            ],
        },
        {
            name: 'Ylitko',
            team: [
                'Артик',
                'Ylitko',
                'Криста',
                'Юрия',
            ],
        },
        {
            name: 'Гермес',
            team: [
                'Sky',
                'Самаритянка',
                'Мишок',
                'Таварес',
            ],
        },
        {
            name: 'Картман',
            team: [
                'Артик',
                'Бон',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'ВБ',
            team: [
                'Наполеон',
                'Жнец',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'Самаритянка',
            team: [
                'Артик',
                'DOCtoR',
                'Самаритянка',
                'Юрия',
            ],
        },
        {
            name: 'Light',
            team: [
                'Ylitko',
                'Мориарти',
                'Sky',
                'Самаритянка',
            ],
        },
        {
            name: 'Юрия',
            team: [
                'Артик',
                'Жнец',
                'Лекса',
                'Юрия',
            ],
        },
        {
            name: 'Мишок',
            team: [
                'Наполеон',
                'Андерсен',
                'Мишок',
                'Юрия',
            ],
        },
        {
            name: 'Фифа',
            team: [
                'Артик',
                'Фифа',
                'Сергеевна',
                'Нефелим',
            ],
        },
        {
            name: 'Светлячок',
            team: [
                'Наполеон',
                'Маг',
                'DOCtoR',
                'Natsy',
            ],
        },
        {
            name: 'Наполеон',
            team: [
                'Наполеон',
                'Sky',
                'Фифа',
                'Криста',
            ],
        },
        {
            name: 'Артик',
            team: [
                'Артик',
                'Озб',
                'Криста',
                'Лекса',
            ],
        },
        {
            name: 'Хайзенберг',
            team: [
                'Артик',
                'Жнец',
                'Сергеевна',
                'Юрия',
            ],
        },
        {
            name: 'Алекси',
            team: [
                'Крис',
                'Мориарти',
                'Криста',
                'Лекса',
            ],
        },
        {
            name: 'Таварес',
            team: [
                'Наполеон',
                'NLIP',
                'Таварес',
                'Юрия',
            ],
        },
        {
            name: 'Есаул',
            team: [
                'Флэш',
                'Ylitko',
                'DOCtoR',
                'Юрия',
            ],
        },
        {
            name: 'Summan',
            team: [
                'Артик',
                'Бон',
                'Сергеевна',
                'Нефелим',
            ],
        },
        {
            name: 'Бон',
            team: [
                'Жнец',
                'Ylitko',
                'Бон',
                'DOCtoR',
            ],
        },
        {
            name: 'Маваши',
            team: [
                'Жнец',
                'Мориарти',
                'Интерактив',
                'Криста',
            ],
        },
        {
            name: 'Гидра',
            team: [
                'Крис',
                'Ylitko',
                'Криста',
                'Лекса',
            ],
        },
        {
            name: 'Deep',
            team: [
                'Артик',
                'Маг',
                'Самаритянка',
                'Юрия',
            ],
        },
        {
            name: 'Мориарти',
            team: [
                'Артик',
                'Мориарти',
                'Нефелим',
                'Natsy',
            ],
        },
        {
            name: 'Капрал',
            team: [
                'Артик',
                'Sky',
                'Самаритянка',
                'Natsy',
            ],
        },
        {
            name: 'Рейновен',
            team: [
                'Наполеон',
                'Sky',
                'DOCtoR',
                'Сергеевна',
            ],
        },
        {
            name: 'Yoda',
            team: [
                'Артик',
                'Ylitko',
                'Yoda',
                'Юрия',
            ],
        },
        {
            name: 'Yesterday',
            team: [
                'Артик',
                'Ylitko',
                'Нефелим',
                'Natsy',
            ],
        },
        {
            name: 'Криста',
            team: [
                'Наполеон',
                'Ylitko',
                'Криста',
                'Нефелим',
            ],
        },
        {
            name: 'Remedy',
            team: [
                'NLIP',
                'Remedy',
                'Интерактив',
                'Криста',
            ],
        },
        {
            name: 'Жнец',
            team: [
                'Наполеон',
                'Жнец',
                'Интерактив',
                'Сергеевна',
            ],
        },
        {
            name: 'Индиго',
            team: [
                'Флэш',
                'Фифа',
                'DOCtoR',
                'Нефелим',
            ],
        },
    ],
};